#pragma warning(disable:4996)
#pragma once
//-----------------------------------------------------------------------------
//プレイヤ
//-----------------------------------------------------------------------------
#include "MyPG.h"
#include "Task_BaseChara.h"

class Player : public BChara
{
	Player(ML::Vec3& p_);
public:
	static void ResourceLoad( );//消すな
	static void ResourceRelease( );//消すな
	static BChara::SP Create(ML::Vec3& p_){	return BChara::SP( new Player(p_) );}
	void Step( );
	void Draw2D( ){};//処理なし
	void Draw3D( );
	~Player( );
//-----------------------------------------------------------------------------
//タスク内変数の宣言（共有）
//-----------------------------------------------------------------------------
	static int refCnt;//消すな
	static DG::cMesh::SP	mesh;
//-----------------------------------------------------------------------------
//タスク内変数の宣言（個別）
//-----------------------------------------------------------------------------
	float		walkSpeed;

//-----------------------------------------------------------------------------
//追加関数
//-----------------------------------------------------------------------------
	DG::cMesh::SP  Mesh( ){ return mesh;}//メッシュを返す

};
